# GetAnnotationCropShape Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewCropRegionShapeManager..::..GetAnnotationCropShape Method
ViewCropRegionShapeManager Class See Also
---
Gets the annotation crop box assigned to the view.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public CurveLoop GetAnnotationCropShape()
```

Visual Basic
---
```text
Public Function GetAnnotationCropShape As CurveLoop
```

Visual C++
---
```text
public:
CurveLoop^ GetAnnotationCropShape()
```

# ### Return Value
The annotation crop boundary.
# Remarks
Currently, this method returns only the rectangular annotation crop box.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | View is not allowed to have an annotation crop. |

# See Also
ViewCropRegionShapeManager Class
Autodesk.Revit.DB Namespace